{
  "ABOUT_ME": "ABOUT ME",
  "COMPANY_SOFTWARE_ARCHITECT": "Sistema Info (Nov 2017 - Dec 2018)",
  "COMPANY_TECH_MANAGER": "Sistema Info (Jan 2024 - currrent)",
  "COMPANY_SOFTWARE_ENGINEERING_MANAGER": "Sistema Info (Jan 2019 - Dec 2023)",
  "CONTACT_ME": "CONTACT ME!",
  "DESCRIPTION_SENIOR_FRONTEND": "Acting in the conversational chatbots team with communication platforms such as Whatsapp, SMS, Instagram, Facebook and etc. Responsible for the technical evolution of the monolith frontend application to a micro frontend managed by Single SPA, using the framework Angular 9 and Angular 10, Vue.js 3 and Vue.js 4. Implementation of E2E tests with Cypress and unit tests with Karma. Using the tool to send data to Google Analytics and using FullStory to analyze customer behavior. Participation in the FrontEnd Chapter and organizer of events about the tech area within the company.",
  "DESCRIPTION_SOFTWARE_ARCHITECT": "My daily tasks included handling technical support tickets to address issues and inquiries regarding web and desktop software, as well as intercepting and analyzing API calls, debugging source code, and performing queries on relational databases using SQL. Additionally, I was responsible for creating FAQs and technical documents to empower end users and enable their autonomy.",
  "DESCRIPTION_TECH_MANAGER": "During my journey, I highlight the creation of the Value-Added Reseller (VAR) Development and Support Department, establishing accreditation criteria that strengthened our strategic relationships. I also prioritized Roadmap demands, ensuring continuous product delivery and increased customer satisfaction, while implementing the Partner Program and Benefits to recognize and incentivize the sales team. My role as an intermediary between the Product Department and resellers, along with market and competitor analysis, ensured product competitiveness and contributed to the company's success.",
  "DESCRIPTION_SOFTWARE_ENGINEERING_MANAGER": "Responsible for managing and developing a team of 13 employees, I oversaw the technical support operation for web and desktop software, ensuring sustainability and loyalty among a customer base of 2,000 clients. I successfully implemented and managed the Movidesk ticketing tool, enabling SLA compliance to enhance customer satisfaction and reduce support analysts' workload through process automation. Additionally, I created and managed customer satisfaction indicators, first response and resolution times, and SLA contracts, providing quick and efficient access to information for the executive team. I also managed project implementation phases for software, ensuring scope, costs, and deadlines were met, while effectively handling technical support service contracts to prevent losses from overtime and excesses.",
  "EVENTS": "EVENTOS",
  "EXPERIENCES": "EXPERIENCES",
  "FIND_ME": "FIND ME",
  "HELLO": "Hi, I'm",
  "HIRE_TALKS": "Want an engaging lecture full of knowledge about software development? Get in touch now and find out how I can share valuable insights and inspire your team or audience",
  "JOBS": "Agile Expert | Scrum Master | Project Manager",
  "LABEL_YEARS_EXPERIENCE_AREA": "years of experience in management area",
  "LABEL_YEARS_EXPERIENCE_DEVELOPMENT": "years of experience in technology",
  "LEARN_MORE": "Learn More",
  "TECH_TALKS": "EVENTS I ATTENDED ",
  "TEXT_ABOUT_ME": "Graduated in Management Processes, currently pursuing a postgraduate degree in Agile Project Management, with 7 years of experience in IT. I began my journey in the technology field in 2017 as a technical support analyst. In early 2019, I was invited to serve as the manager of the technical support team. Since then, I have been immersed in team management, particularly focusing on the development of new technology professionals. I emphasize my expertise in departmental creation, quality process management (ISO 9001), project management, hiring/termination procedures, indicator management, and results presentation. In 2024, I transitioned to become a part of the product business unit council, contributing to tactical and strategic decisions while ensuring operational results. Currently, I am deeply passionate about the agile world, an area in which I am specializing through my postgraduate studies at XP Educação. Beyond my professional pursuits, I have various hobbies; I hold a blue belt in jiu-jitsu, enjoy surfing, and relish being in nature. I strive to stay connected with the technology world, actively participating in events such as TDC, Front in Floripa, and Brasil Empreende. I firmly believe that technology transforms the world daily, and my focus is to steer my career in that direction to positively impact people through technology.",
  "TITLE_SOFTWARE_ARCHITECT": "Technical Support Analyst",
  "TITLE_SOFTWARE_ENGINEERING_MANAGER": "Techinical Support Manager",
  "TITLE_TECH_MANAGER": "Channel Manager",
  "VOLUNTEER": "VOLUNTEER WORKS",
  "TALKS": [
    {
      "event": "DevTEC Event",
      "local": "Tubarão - SC / Brazil",
      "date": "06/20/2023",
      "talk": "Cracking the Design System",
      "link": "https://www.canva.com/design/DAFl1BSagiE/srEiB7l9By_6d1xKlAg87w/edit?utm_content=DAFl1BSagiE&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
      "logo": "/icons/logo-dev-tec.svg"
    },
    {
      "event": "DevTEC Event",
      "local": "Tubarão - SC / Brazil",
      "date": "06/20/2023",
      "talk": "Debate about How to Start a Career in Software Development",
      "link": "",
      "logo": "/icons/logo-dev-tec.svg"
    },
    {
      "event": "The Developers Conference Innovation | Track about FrontEnd development",
      "local": "Porto Alegre - RS / Brazil",
      "date": "06/12/2021",
      "talk": "Debate about Innovation in JavaScript",
      "link": "",
      "logo": "/icons/logo-thedevconf.svg"
    }
  ]
}
