{
  "ABOUT_ME": "SOBRE MIM",
  "COMPANY_SOFTWARE_ARCHITECT": "Sistema Info (Nov 2017 - Dez 2018)",
  "COMPANY_TECH_MANAGER": "Sistema Info (Jan 2024 - até o momento)",
  "COMPANY_SOFTWARE_ENGINEERING_MANAGER": "Sistema Info (Jan 2019 - Dez 2023)",
  "CONTACT_ME": "ENTRE EM CONTATO COMIGO!",
  "DESCRIPTION_SENIOR_FRONTEND": "Atuação no time de chatbots conversacionais com as plataformas de comunicação como Whatsapp, SMS, Instagram, Facebook e etc. Responsável pela evolução técnica da aplicação frontend monolito para micro frontend gerenciado por Single SPA, com o uso do framework Angular 9 e Angular 10, Vue.js 3 e Vue.js 4. Implementação de testes E2E com Cypress e testes unitários com Karma. Utilização da ferramenta para envio de dados para o Google Analytics e uso FullStory para analisar o comportamento do cliente. Participação no Chapter de FrontEnd e organizadora de eventos sobre a área tech dentro da empresa.",
  "DESCRIPTION_SOFTWARE_ARCHITECT": "Minha rotina envolvia o atendimento de chamados técnicos para solucionar problemas e dúvidas relacionados a softwares web e desktop, assim como a interceptação e análise de chamadas de APIs, a análise e depuração de código fonte, e consultas em bancos de dados relacionais utilizando SQL. Além disso, eu também era responsável pela elaboração de FAQs e documentos técnicos para capacitar o usuário final e permitir sua autonomia.",
  "DESCRIPTION_TECH_MANAGER": "Durante minha jornada, destaco a criação do Setor de Desenvolvimento e Sustentação de Revendas de Valor Agregado (VAR), estabelecendo critérios de credenciamento que fortaleceram nossas relações estratégicas. Também priorizei demandas do Roadmap, garantindo a entrega contínua de produtos e maior satisfação dos clientes, além de implementar o Programa de Parceiros e Benefícios para reconhecer e incentivar a equipe comercial. Meu papel como intermediário entre o Setor de Produtos e as revendas, aliado à análise de mercado e concorrência, assegurou a competitividade dos produtos e contribuiu para o sucesso da empresa.",
  "DESCRIPTION_SOFTWARE_ENGINEERING_MANAGER": "Responsável pela gestão e desenvolvimento profissional de 13 liderados, supervisei a operação de suporte técnico para softwares web e desktop, garantindo a sustentabilidade e fidelização de uma base de clientes de 2.000 clientes. Implementei e gerenciei com sucesso a ferramenta de chamados Movidesk, viabilizando a conformidade com SLA para melhorar a satisfação do cliente e reduzir a carga de trabalho dos analistas de suporte por meio da automação de processos. Além disso, criei e gerenciei indicadores de satisfação do cliente, tempos de primeira resposta e resolução, e contratos de SLA, proporcionando acesso rápido e eficiente às informações para a equipe executiva. Também gerenciei as fases de implementação de projetos de software, garantindo o cumprimento do escopo, custos e prazos, além de lidar efetivamente com contratos de serviços de suporte técnico para evitar prejuízos com horas extras e excessos.",
  "EVENTS": "Eventos (9)",
  "EXPERIENCES": "EXPERIÊNCIAS",
  "FIND_ME": "ME ENCONTRE",
  "HELLO": "Olá!",
  "HIRE_TALKS": "Quer uma palestra envolvente e repleta de conhecimento sobre desenvolvimento de software? Entre em contato agora mesmo e descubra como posso compartilhar insights valiosos e inspirar sua equipe ou público",
  "JOBS": "Agile Expert | Scrum Master | Gerente de Projetos",
  "LABEL_YEARS_EXPERIENCE_AREA": "anos de experiência na área de gestão",
  "LABEL_YEARS_EXPERIENCE_DEVELOPMENT": "anos de experiência em tecnologia",
  "LEARN_MORE": "Saiba Mais",
  "TECH_TALKS": "EVENTOS QUE PARTICIPEI",
  "TEXT_ABOUT_ME": "Formado em Processos Gerenciais, pós-graduando em Gestão Ágil de Projetos, 7 anos de experiência em TI, iniciei na área de tecnologia em 2017 como analista de suporte técnico. No início de 2019 fui convidado a atuar como gestor da equipe de suporte técnico. Desde então, venho trabalhando com gestão de equipes, focado na formação de novos profissionais de tecnologia. Destaco minha expertise na criação de setores, gerenciamento de processos de qualidade (ISO 9001), gerenciamento de projetos, contratação/desligamento de profissionais, gestão de indicadores e apresentação de resultados. Em 2024, passei a integrar o conselho da unidade de negócios de produto, contribuindo para decisões táticas e estratégicas, assegurando os resultados operacionais. Atualmente estou apaixonado pelo mundo ágil, área a qual estou me especializando na pós-graduação, na XP Educação. Tenho vários hobbies, sou faixa azul de jiu-jitsu, gosto muito de surfar e estar em contato com a natureza. Procuro estar sempre em contato com o mundo de tecnologia, participando de eventos como TDC, Front in Floripa e Brasil Empreende. Acredito que a tecnologia muda o mundo todos os dias, e meu foco é manter minha carreira nessa direção para ajudar as pessoas através da tecnologia",
  "TITLE_SOFTWARE_ARCHITECT": "Analista de Suporte",
  "TITLE_SOFTWARE_ENGINEERING_MANAGER": "Gerente de Suporte Técnico",
  "TITLE_TECH_MANAGER": "Gerente de Canais",
  "VOLUNTEER": "TRABALHOS VOLUNTÁRIOS",
  "SKILLS_SENIOR_FRONTEND": "SingleSPA, MicroFrontEnd, Angular (Framework), Vue.js, Google Analytics, FullStory",
  "SKILLS_SOFTWARE_ARCHITECT": "StencilJS, React, NextJS, TypeScript, Node.js, Strapi, Azure DevOps",
  "TALKS": [
    {
      "event": "DevTEC",
      "local": "Tubarão - SC / Brasil",
      "date": "06/20/2023",
      "talk": "Desvendendo o Design System",
      "link": "https://www.canva.com/design/DAFl1BSagiE/srEiB7l9By_6d1xKlAg87w/edit?utm_content=DAFl1BSagiE&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
      "logo": "/icons/logo-dev-tec.svg"
    },
    {
      "event": "DevTEC",
      "local": "Tubarão - SC / Brasil",
      "date": "06/20/2023",
      "talk": "Como iniciar na carreira de tecnologia",
      "link": "",
      "logo": "/icons/logo-dev-tec.svg"
    },
    {
      "event": "The Developers Conference | trilha JavaScript - Front End",
      "local": "Porto Alegre - RS / Brasil",
      "date": "06/12/2021",
      "talk": "Desenvolvimento Front End",
      "link": "",
      "logo": "/icons/logo-thedevconf.svg"
    }
  ]
}
